// 项目名称: 双色球系统
// 项目描述:
//		双色球一直都是大家喜闻乐见的娱乐行为，搏一搏，单车变摩托！（仅供娱乐，请勿沉迷）
//		双色球规则: 
//			1、一注双色球由6个红球和1个蓝球组成
//			2、红球的范围是[1,33]，且不能重复
//			3、蓝球的范围是[1,16]
//			4、展示的时候，红球在前，蓝球在后。并且红球部分需要进行升序排序
//			5、展示的时候，红球与蓝球的数字不够两位的，需要往前补0凑够两位，例如 01 02 03
//		双色球中奖规则及奖金:
//			+-----------+-----------+----------+--------------------+
//          | 奖项		| 红球正确数  | 蓝球正确数 | 中奖金额				|
//			+-----------+-----------+----------+--------------------+
//			| 一等奖		| 6		    | 1		   | 5000000			|
//			+-----------+-----------+----------+--------------------+
//          | 二等奖		| 6		    | 0		   | 800000		    	|
//			+-----------+-----------+----------+--------------------+
//          | 三等奖		| 5		    | 1		   | 3000   			|
//			+-----------+-----------+----------+--------------------+
//          | 四等奖		| 5		    | 0		   | 200   			    |
//          |    		| 4		    | 1		   |        			|
//			+-----------+-----------+----------+--------------------+
//          | 五等奖		| 4		    | 0		   | 10      			|
//          |    		| 3		    | 1		   |        			|
//			+-----------+-----------+----------+--------------------+
//          | 六等奖		| 2		    | 1		   | 5      			|
//          |    		| 1		    | 1		   |        			|
//          |    		| 0		    | 1		   |        			|
//			+-----------+-----------+----------+--------------------+
// 项目需求:
//		1、完成基本的用户交互，可以让用户在控制台上进行自己的选择(自选号码、机选号码)
//		2、完成用户自选号码的输入控制
//		3、完成机选号码的实现（随机生成一注双色球，也可以用来生成中奖号码）
//		4、完成用户选择的号码与中奖号码的展示
//		5、完成奖项的判定与输出、中奖金额的判定与输出