#include <iostream>
/*
using namespace std;

int main() {
	// 算术运算符：对数字类型（整型、浮点型、字符型）的数据进行运算
	// +	: 加法运算
	// -	: 减法运算
	// *	: 乘法运算
	// /	: 除法运算
	// %	: 模运算（求余数）
	// 
	// 注意事项：整型与整型的计算结果，还是整型。如果出现了浮点的计算结果，会自动将浮点的结果类型转换成整型。

	cout << "10 + 3 = " << 10 + 3 << endl;		// 13
	cout << "10 - 3 = " << 10 - 3 << endl;		// 7
	cout << "10 * 3 = " << 10 * 3 << endl;		// 30
	cout << "10 / 3 = " << 10 / 3 << endl;		// 3
	cout << "10 % 3 = " << 10 % 3 << endl;		// 1


	// ++	: 自增运算符，只能操作一个变量，表示对这个变量的值在现有的基础上 +1
	// --	: 自减运算符，只能操作一个变量，表示对这个变量的值在现有的基础上 -1

	// 注意事项：自增自减运算符，可以放在变量前，也可以放在变量后。
	// 放在变量前：代表先对变量进行自增自减的操作，然后取自增自减之后的值来使用。
	// 放在变量后：代表先取变量的值使用，然后再进行自增自减的操作。

	int num = 10;
	// --num;
	// cout << num << endl;

	cout << --num << endl;
	cout << num << endl;


	// 小练习:
	// 在控制台上输入一个三位的数字，输出每一位的数字的和。例如，输入123，输出6
	// TIPS: 不用考虑用户输入错误，需要重新输入；也不需要考虑用户输入的不是一个三位数。
	int number = 0;
	cout << "请输入一个三位的数字: ";
	cin >> number;

	int g = number % 10;
	int s = number / 10 % 10;
	int b = number / 100;

	cout << g + s + b << endl;


	return 0;
}
*/