#include <iostream>

/*
using namespace std;

int main() {

	// 位运算符

	// & | ^ ~
	// 13 = 0000 1101  
	// 21 = 0010 0101

	// ~: 按位取反，将每一位的数字都取反（0变成1，1变成0），包括符号位。

	cout << (13 & 21) << endl;		// 0000 0101	=> 5
	cout << (13 | 21) << endl;		// 0010 1101	=> 16 + 8 + 4 + 1 => 29
	cout << (13 ^ 21) << endl;		// 0010 1000	=> 16 + 8 => 24
	cout << ~13 << endl;			// 1111 0010	=> 1000 1110 => -14

	// << : 位左移运算符, 将补码中的每一位依次向左移动指定的位数, 左边溢出的部分舍去, 右边补0
	// >> : 位右移运算符, 将补码中的每一位依次向右移动指定的位数, 右边溢出的部分舍去, 左边补符号位
	//
	// 逻辑体现：每向左移动一位，相当于乘了一个2；每向右移动一位，相当于除了一个2
	// 与前面的除法运算符不同，结果是向下取整的
	cout << (13 << 2) << endl;		// 0011 0100	=> 32 + 16 + 4 => 52
	cout << (-13 >> 2) << endl;		// 0000 0011    => 2 + 1 => 3

	// 如何高效率的计算 8 * 2
	// cout << (8 * 2) << endl;
	// cout << (8 << 1) << endl;

	return 0;
}
*/